console.log('Hello JavaScript!');

// alert(1000 + 4000 + 100);

/*
####### Statement ######## 
- 하나 혹은 여러 개의 표현식이 모여 문장을 이룬다.
- 모든 표현식은 문장이 될 수 있다.
- (보통) 문장의 끝에는 세미 콜론을 붙인다.

true;
26;
"Anna";
"Hello" + "JavaScript";
var name = "Mark";
alert('Hello');

- 한 줄에 문장이 하나인 경우에는 세미 콜론을 붙이지 않아도 문제가 없다.
**하지만, 관례적으로 붙인다.**
- 한 줄에 여러 문장을 적을 경우, 세미 콜론으로 문장을 구분해야 한다.
- 마지막 문장은 세미 콜론을 붙이지 않아도 문제가 없다.
- 마지막 문장의 결과가 반환된다.

true; 26; 1000 + 900 + 400
2300이 반환된다.

- if, for문도 문장이다.
- 이 경우에는 마지막 } 뒤에 세미콜론을 붙이지 않는다.

- 문장들이 모여 만들고자 하는 프로그램이 된다.
*/


